"""
Модуль для инициализации и управления жизненным циклом Telegram-бота.

Этот файл содержит создание экземпляров бота и диспетчера, а также функции
для отправки уведомлений администратору при запуске и остановке бота.

Attributes:
    bot (Bot): Экземпляр Telegram-бота с предустановленными свойствами.
    dp (Dispatcher): Диспетчер для регистрации хэндлеров и обработки событий.

Functions:
    start_bot(): Отправить администратору уведомление о запуске бота.
    stop_bot(): Отправить администратору уведомление об остановке бота.
"""

from aiogram import Bot, Dispatcher
from aiogram.client.default import DefaultBotProperties
from aiogram.enums import ParseMode
from aiogram.client.session.aiohttp import AiohttpSession
from aiohttp import BasicAuth
from config import settings


bot: Bot = Bot(
    token=settings.bot_token,
    default=DefaultBotProperties(parse_mode=ParseMode.HTML),
    session=AiohttpSession(
        proxy=(
            f"http://{settings.proxy_host}:{settings.proxy_port}",
            BasicAuth(login=settings.proxy_user, password=settings.proxy_pass)
        )
    )
)
"""Экземпляр Telegram-бота с предустановленными свойствами."""

dp = Dispatcher()
"""Диспетчер для регистрации хэндлеров и обработки событий."""


async def start_bot():
    """
    Отправить администратору уведомление о запуске бота.

    При успешном старте бот отправляет сообщение с текстом «Я запущен🥳».
    В случае ошибки при отправке сообщение игнорируется.
    """
    await bot.send_message(settings.admin_id, "Я запущен🥳.")


async def stop_bot():
    """
    Отправить администратору уведомление об остановке бота.

    При завершении работы бот отправляет сообщение с текстом «Бот остановлен.».
    В случае ошибки при отправке сообщение игнорируется.
    """
    await bot.send_message(settings.admin_id, "Бот остановлен.")
